Revit 2024 API
DoubleParameterValue Class
 A class that holds a Double value of a parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public class DoubleParameterValue : ParameterValue
Visual Basic
Public Class DoubleParameterValue _
	Inherits ParameterValue
Visual C++
public ref class DoubleParameterValue : public ParameterValue
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.DoubleParameterValue
See Also
DoubleParameterValue Members
Autodesk.Revit.DB Namespace